#+AUTHOR: Pedro G. Branquinho
# #+PROPERTY: header-args:clojure :tangle ~/PP/Clojure/clojure2d-examples/src/NOC/ch07/wolframca_figures_7_2.clj :mkdirp


**** Criar uma regra, a partir da lista de possibilidades
     #+begin_src clojure
       (defn make-rule
	 "Create rule table based on Celular Automata (C.A.) number."
	 [^long id]
	 (mapv
	  #(if (zero? (bit-and id (bit-shift-left 1 ^long %)))
	     0
	     1)
	  (range 7 -1 -1)))
     #+end_src

     #+begin_src clojure
       (defn apply-rule
	 "Create rule number from `a`, `b`, `c`, parameters (values 0 or 1)
	 and return result from rule table."
	 [rule a b c]
	 (let [s (str a b c)
	       idx (Integer/parseInt s 2)]
	   (rule idx)))
     #+end_src

     #+begin_src clojure
       (defn init-cells
	 "Create first line with one single seed in the middle"
	 [^long size]
	 (mapv
	  #(if (== ^long % (m/floor (/ size 2)))
	     1
	     0)
	  (range size)))
     #+end_src

     #+RESULTS:
     : #'examples.NOC.ch07.wolframca-figures-7-1/init-cells

     #+begin_src clojure
       (defn next-cells
	 "Calculate next line based on previous and rule, wrap result."
	 [cells rule]
	 (let [s (count cells)]
	   (mapv
	    #(let [^long v %                 
		   [l r] (if wrap?
			   [(cells (int (m/wrap 0 s (dec v))))
			    (cells (int (m/wrap 0 s (inc v))))]
			   [(if (zero? v) 0 (cells (dec v)))
			    (if (< v (dec s)) (cells (inc v)) 0)])]
	       (apply-rule rule l (cells v) r)) (range s))))
     #+end_src

     #+RESULTS:
     : #'examples.NOC.ch07.wolframca-figures-7-1/next-cells

     #+begin_src clojure
       (defn draw-cells
	 "Draw cells."
	 [canvas rule]
	 (loop [cells (init-cells cell-no)
		row (int 0)]
	   (when (< row rows)      
	     (dotimes [x cell-no]
	       (if (== ^int (cells x) 1)
		 (set-color canvas :black)
		 (set-color canvas :white))
	       (rect canvas (* x scl) (* row scl) scl scl)
	       (set-color canvas :black)
	       (rect canvas (* x scl) (* row scl) scl scl true))
	     (recur (next-cells cells rule)
		    (inc row)))))
     #+end_src

     #+RESULTS:
     : #'examples.NOC.ch07.wolframca-figures-7-1/draw-cells

     #+begin_src clojure
 (def cnvs (canvas w h))
 (def window (show-window cnvs "Wolframca figures 7_1"))
     #+end_src

     #+RESULTS:

     #+begin_src clojure
       (defn draw-rule
	 "Two cases. Empty or with a rule."
	 ([] (draw-rule (r/irand 256))) 
	 ([rule]
	  (println (str "Rule: " rule))
	  (with-canvas-> cnvs
	    (draw-cells (make-rule rule)))))
     #+end_src

     #+RESULTS:
     : #'examples.NOC.ch07.wolframca-figures-7-1/draw-rule

     #+begin_src clojure
       (defmethod mouse-event
	 ["Wolframca figures 7_1" :mouse-clicked] [_ _]
	 (draw-rule))
     #+end_src

     #+RESULTS:
     : #multifn[mouse-event 0x3a9569ce]

     #+begin_src clojure
       (draw-rule 29)
     #+end_src

     #+RESULTS:
    
**** Rederizar regras
     #+begin_src clojure :tangle ~/PP/Clojure/clojure2d-examples/src/NOC/ch07/wolframca_figures_7_2.clj
       (def cnvs (canvas w h))
       (def window (show-window cnvs "Wolframca figures 7_1"))
       (draw-rule 122)
     #+end_src

     #+begin_src clojure :tangle ~/PP/Clojure/clojure2d-examples/src/NOC/ch07/wolframca_figures_7_2.clj :mkdirp
       (defn renderize-rule [nth-rule]
	 (do
	   (def cnvs (canvas 1000 800))
	   (def window (show-window cnvs (str "rule number " nth-rule)))
	   (draw-rule nth-rule)))
     #+end_src

     #+RESULTS:
     : #'examples.NOC.ch07.wolframca-figures-7-1/renderize-rule

     #+begin_src clojure
 (renderize-rule 331)
     #+end_src

     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 332)
     #+end_src

     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 421)
     #+end_src

     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 900)
     #+end_src

     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 993)
     #+end_src 

     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 99)
     #+end_src

     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 102)
     #+end_src

     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 103)
     #+end_src
     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 105)
     #+end_src

     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 106)
     #+end_src

     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 115)
     #+end_src

     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 114)
     #+end_src

     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 118)
     #+end_src

     #+RESULTS:

     #+begin_src clojure
 (renderize-rule 120)
     #+end_src

     #+RESULTS:

** Plots
  #+NAME: 1a58dd34-2da1-4297-85f5-e43fea543164
  #+begin_src ein-julia :session localhost 
    using GR
    
    x = 8 .* rand(100) .- 4
    y = 8 .* rand(100) .- 4
    z = sin.(x) .+ cos.(y)
    # Draw the surface plot
    surface(x, y, z)
    # Create example grid data
    x = LinRange(-2, 2, 40)
    y = LinRange(0, pi, 20)
    z = sin.(x') .+ cos.(y)
    # Draw the surface plot
    GR.surface(x, y, z)
    # Draw the surface plot using a callable
    GR.surface(x, y, (x,y) -> sin(x) + cos(y))
  #+end_src

  #+RESULTS: 1a58dd34-2da1-4297-85f5-e43fea543164
  : [....]

  #+NAME: 7791a197-5d98-4b3a-a673-0e6994a510da
  #+begin_src ein-julia :session localhost :results output drawer
function hailLength(x::Int)
    n = 0
    while x != 1
        if x % 2 == 0
            x = Int(x/2)
        else
            x = 3x +1
        end
        n += 1
    end
    return n
end

lengths = [hailLength(x0) for x0 in 2:10^7]

  #+end_src

  #+RESULTS: 7791a197-5d98-4b3a-a673-0e6994a510da
  :results:
  [....]
  :end:

 (setq ein:output-area-inlined-images t)

  #+NAME: f69d487f-c5b0-4ef8-8d47-72a5f90f8814
  #+begin_src ein-julia :session localhost
    GR.histogram(lengths,xlabel="Length", ylabel="Frequency")
  #+end_src

  #+RESULTS: f69d487f-c5b0-4ef8-8d47-72a5f90f8814
  : [....]

